Revit 2027 API
DividedSurface.IsComponentFlipped Property
Whether the pattern is flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsComponentFlipped { get; set; }
Public Property IsComponentFlipped As Boolean
	Get
	Set
public:
property bool IsComponentFlipped {
	bool get ();
	void set (bool value);
}
member IsComponentFlipped : bool with get, set
Property Value
Boolean
Remarks
This property has no effect unless a pattern is selected (the ObjectType property is not null). Changing this flag effectively reflects the component through its XY-plane, which is equivalent to reflecting it through the original surface.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace